In [1]:
# Set up environment to make viewing the output easier

import pandas as pd

In [2]:
pd.options.display.float_format = '{:,.2f}'.format
pd.set_option('display.width', 85)
pd.set_option('display.max_columns', 8)

# Import csv file

In [3]:
# To read a csv file use the below
landtemps = pd.read_csv('data/landtempssample.csv', names=['stationid','year','month','avgtemp','latitude',
                'longitude','elevation','station','countryid','country'], skiprows=1, low_memory=False,
                       parse_dates=[['month', 'year']])

In [5]:
landtemps.head()

,month_year,stationid,avgtemp,latitude,...,elevation,station,countryid,country
0,2000-04-01,USS0010K01S,5.27,39.90,...,"2,773.70",INDIAN_CANYON,US,United States
1,1940-05-01,CI000085406,18.04,-18.35,...,58.00,ARICA,CI,Chile
2,2013-12-01,USC00036376,6.22,34.37,...,61.00,SAINT_CHARLES,US,United States
3,1963-02-01,ASN00024002,22.93,-34.28,...,65.50,BERRI_IRRIGATION,AS,Australia
4,2001-11-01,ASN00028007,nan,-14.78,...,79.40,MUSGRAVE,AS,Australia

In [6]:
# Give the month_year a better name called 'month' 
landtemps.rename(columns={'month_year': 'measuredate'}, inplace=True)

In [7]:
landtemps.columns

Index(['measuredate', 'stationid', 'avgtemp', 'latitude', 'longitude', 'elevation',
       'station', 'countryid', 'country'],
      dtype='object')

In [8]:
# Calculate summary stat on numerical variable
landtemps.avgtemp.describe()

count   85,554.00
mean        10.92
std         11.52
min        -70.70
25%          3.46
50%         12.22
75%         19.57
max         39.95
Name: avgtemp, dtype: float64

In [9]:
# Check missing value

landtemps.isnull().sum()

measuredate        0
stationid          0
avgtemp        14446
latitude           0
longitude          0
elevation          0
station            0
countryid          0
country            5
dtype: int64

In [10]:
# Remove subset of rows with avgtemp missing values

len(landtemps)

100000

In [11]:
landtemps.dropna(inplace=True)

In [12]:
len(landtemps)

85552

In [13]:
landtemps.isnull().sum()

measuredate    0
stationid      0
avgtemp        0
latitude       0
longitude      0
elevation      0
station        0
countryid      0
country        0
dtype: int64

# Reading a Zip File

In [14]:
# pd.read_csv can read a zip file. Compression arg should be provided with zip

# landtemps = pd.read_csv('data/landtemps.zip', names=['stationid','year','month','avgtemp','latitude',
#                 'longitude','elevation','station','countryid','country'], skiprows=1, low_memory=False,
#                        parse_dates=[['month', 'year']], compression='zip')

In [77]:
# Read Excel file
# we note the sheet_name of the excel file
# We skipped first 4 rows including the header, and also skipped the last row
# The column used are A and C through T. column B is excluded

percapitaGDP = pd.read_excel("data/GDPpercapita.xlsx", sheet_name="OECD.Stat export", skiprows=4, skipfooter=1,
                                    usecols="A,C:T")

In [78]:
percapitaGDP.head()

                         Year   2001   2002   2003  ...   2015   2016   2017   2018
0          Metropolitan areas    NaN    NaN    NaN  ...    NaN    NaN    NaN    NaN
1              AUS: Australia     ..     ..     ..  ...     ..     ..     ..     ..
2       AUS01: Greater Sydney  43313  44008  45424  ...  50075  50519  50578  49860
3    AUS02: Greater Melbourne  40125  40894  41602  ...  42928  42671  43025  42674
4     AUS03: Greater Brisbane  37580  37564  39080  ...  44388  45723  46876  46640

[5 rows x 19 columns]

In [79]:
# To get info on attribute, their data types and number of non-null value

percapitaGDP.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 702 entries, 0 to 701
Data columns (total 19 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Year    702 non-null    object
 1   2001    701 non-null    object
 2   2002    701 non-null    object
 3   2003    701 non-null    object
 4   2004    701 non-null    object
 5   2005    701 non-null    object
 6   2006    701 non-null    object
 7   2007    701 non-null    object
 8   2008    701 non-null    object
 9   2009    701 non-null    object
 10  2010    701 non-null    object
 11  2011    701 non-null    object
 12  2012    701 non-null    object
 13  2013    701 non-null    object
 14  2014    701 non-null    object
 15  2015    701 non-null    object
 16  2016    701 non-null    object
 17  2017    701 non-null    object
 18  2018    701 non-null    object
dtypes: object(19)
memory usage: 104.3+ KB

In [80]:
# Rename Year column to metro and remove leading and trailing spaces in metro

percapitaGDP.rename(columns={'Year': 'metro'}, inplace=True)

In [81]:
# To check if there is leading and trailing space
print(percapitaGDP.metro.str.startswith(' ').any())
print(percapitaGDP.metro.str.endswith(' ').any())

# Remove trailing and leading spaces in metro column
percapitaGDP.metro = percapitaGDP.metro.str.strip()

True
True

In [82]:
# To check again there is leading and trailing space
print(percapitaGDP.metro.str.startswith(' ').any())
print(percapitaGDP.metro.str.endswith(' ').any()) # All clear, its false

False
False

In [83]:
# Iterate over 2001-2018 column to convert them to numeric data and rename the columns

for col in percapitaGDP.columns[1:]:
    percapitaGDP[col] = pd.to_numeric(percapitaGDP[col], errors='coerce') # coerce force the string character to Nan
    percapitaGDP.rename(columns={col: 'pcGDP' + col }, inplace=True)

In [84]:
percapitaGDP.columns

Index(['metro', 'pcGDP2001', 'pcGDP2002', 'pcGDP2003', 'pcGDP2004', 'pcGDP2005',
       'pcGDP2006', 'pcGDP2007', 'pcGDP2008', 'pcGDP2009', 'pcGDP2010', 'pcGDP2011',
       'pcGDP2012', 'pcGDP2013', 'pcGDP2014', 'pcGDP2015', 'pcGDP2016', 'pcGDP2017',
       'pcGDP2018'],
      dtype='object')

In [85]:
percapitaGDP.head()

,metro,pcGDP2001,pcGDP2002,pcGDP2003,...,pcGDP2015,pcGDP2016,pcGDP2017,pcGDP2018
0,Metropolitan areas,nan,nan,nan,...,nan,nan,nan,nan
1,AUS: Australia,nan,nan,nan,...,nan,nan,nan,nan
2,AUS01: Greater Sydney,"43,313.00","44,008.00","45,424.00",...,"50,075.00","50,519.00","50,578.00","49,860.00"
3,AUS02: Greater Melbourne,"40,125.00","40,894.00","41,602.00",...,"42,928.00","42,671.00","43,025.00","42,674.00"
4,AUS03: Greater Brisbane,"37,580.00","37,564.00","39,080.00",...,"44,388.00","45,723.00","46,876.00","46,640.00"

In [86]:
percapitaGDP.info() # objects successfully converted to numbers

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 702 entries, 0 to 701
Data columns (total 19 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   metro      702 non-null    object
 1   pcGDP2001  424 non-null    float64
 2   pcGDP2002  440 non-null    float64
 3   pcGDP2003  440 non-null    float64
 4   pcGDP2004  440 non-null    float64
 5   pcGDP2005  447 non-null    float64
 6   pcGDP2006  447 non-null    float64
 7   pcGDP2007  447 non-null    float64
 8   pcGDP2008  455 non-null    float64
 9   pcGDP2009  471 non-null    float64
 10  pcGDP2010  471 non-null    float64
 11  pcGDP2011  480 non-null    float64
 12  pcGDP2012  480 non-null    float64
 13  pcGDP2013  480 non-null    float64
 14  pcGDP2014  480 non-null    float64
 15  pcGDP2015  480 non-null    float64
 16  pcGDP2016  480 non-null    float64
 17  pcGDP2017  445 non-null    float64
 18  pcGDP2018  441 non-null    float64
dtypes: float64(18), object(1)
memory usage: 104.3+ KB

In [87]:
percapitaGDP.shape

(702, 19)

In [88]:
# Drop nan values
percapitaGDP.dropna(subset=percapitaGDP.columns[1:], how='all', inplace=True)

In [89]:
percapitaGDP.shape

(480, 19)

In [92]:
# To ensure there are 480 valid numbers in mtero column
print(percapitaGDP.metro.count())
print(percapitaGDP.metro.nunique())

# set the index on metro column
percapitaGDP.set_index('metro', inplace=True)

480
480

In [93]:
percapitaGDP.head()

,pcGDP2001,pcGDP2002,pcGDP2003,pcGDP2004,...,pcGDP2015,pcGDP2016,pcGDP2017,pcGDP2018
metro,,,,,,,,,
AUS01: Greater Sydney,"43,313.00","44,008.00","45,424.00","45,837.00",...,"50,075.00","50,519.00","50,578.00","49,860.00"
AUS02: Greater Melbourne,"40,125.00","40,894.00","41,602.00","42,188.00",...,"42,928.00","42,671.00","43,025.00","42,674.00"
AUS03: Greater Brisbane,"37,580.00","37,564.00","39,080.00","40,762.00",...,"44,388.00","45,723.00","46,876.00","46,640.00"
AUS04: Greater Perth,"45,713.00","47,371.00","48,719.00","51,020.00",...,"66,544.00","66,032.00","66,424.00","70,390.00"
AUS05: Greater Adelaide,"36,505.00","37,194.00","37,634.00","37,399.00",...,"40,295.00","39,737.00","40,115.00","39,924.00"

In [94]:
percapitaGDP.loc['AUS02: Greater Melbourne']

pcGDP2001   40,125.00
pcGDP2002   40,894.00
pcGDP2003   41,602.00
pcGDP2004   42,188.00
pcGDP2005   41,484.00
pcGDP2006   41,589.00
pcGDP2007   42,316.00
pcGDP2008   40,975.00
pcGDP2009   41,384.00
pcGDP2010   40,943.00
pcGDP2011   41,165.00
pcGDP2012   41,264.00
pcGDP2013   41,157.00
pcGDP2014   42,114.00
pcGDP2015   42,928.00
pcGDP2016   42,671.00
pcGDP2017   43,025.00
pcGDP2018   42,674.00
Name: AUS02: Greater Melbourne, dtype: float64

In [95]:
# Using iloc to obtain thne same result as above

percapitaGDP.iloc[1]

pcGDP2001   40,125.00
pcGDP2002   40,894.00
pcGDP2003   41,602.00
pcGDP2004   42,188.00
pcGDP2005   41,484.00
pcGDP2006   41,589.00
pcGDP2007   42,316.00
pcGDP2008   40,975.00
pcGDP2009   41,384.00
pcGDP2010   40,943.00
pcGDP2011   41,165.00
pcGDP2012   41,264.00
pcGDP2013   41,157.00
pcGDP2014   42,114.00
pcGDP2015   42,928.00
pcGDP2016   42,671.00
pcGDP2017   43,025.00
pcGDP2018   42,674.00
Name: AUS02: Greater Melbourne, dtype: float64

# Read data from mssql server

In [97]:
pip install pymssql

Collecting pymssql
  Downloading pymssql-2.1.5-cp37-cp37m-win_amd64.whl (411 kB)
Installing collected packages: pymssql
Successfully installed pymssql-2.1.5
Note: you may need to restart the kernel to use updated packages.

- Import pandas, numpy, pymssql

In [1]:
import pandas as pd
import numpy as np
import pymssql

#### Use the pymssql API and read_sql to retrieve and load data from a SQL Server instance.

- Select the columns we want from the SQL Server data and use SQL aliases on column names
- Create a connection to the SQL Server data by passing database credentials to the pymssql connect function
- Create a pandas data frame by passing the select statement and connection object to read_sql.
- Close the connection to return it to the pool on the server

In [9]:
# Assign the relevant parameters needed to establish connection
query = "SELECT studentid, school, sex, age, famsize, medu AS mothereducation, fedu AS fathereducation,\
            traveltime, studytime, failures, famrel, freetime, goout, g1 AS gradeperiod1, g2 AS gradeperiod2,\
            g3 AS gradeperiod3 FROM STUDENTMATH"

server = "pdcc.c9sqqzd5fulv.us-west-2.rds.amazonaws.com"
user = "pdccuser"
password = "pdccpass"
database = "pdcctest"

In [10]:
conn = pymssql.connect(server=server, user=user, password=password, database=database)

In [11]:
studentmath = pd.read_sql(query,conn)

In [ ]:
conn.close() # Close the connection

In [12]:
studentmath.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 395 entries, 0 to 394
Data columns (total 16 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   studentid        395 non-null    object
 1   school           395 non-null    object
 2   sex              395 non-null    object
 3   age              395 non-null    int64
 4   famsize          395 non-null    object
 5   mothereducation  395 non-null    int64
 6   fathereducation  395 non-null    int64
 7   traveltime       395 non-null    int64
 8   studytime        395 non-null    int64
 9   failures         395 non-null    int64
 10  famrel           395 non-null    int64
 11  freetime         395 non-null    int64
 12  goout            395 non-null    int64
 13  gradeperiod1     395 non-null    int64
 14  gradeperiod2     395 non-null    int64
 15  gradeperiod3     395 non-null    int64
dtypes: int64(12), object(4)
memory usage: 49.5+ KB

In [13]:
studentmath.head()

,studentid,school,sex,age,famsize,mothereducation,fathereducation,traveltime,studytime,failures,famrel,freetime,goout,gradeperiod1,gradeperiod2,gradeperiod3
0,001,GP,F,18,GT3,4,4,2,2,0,4,3,4,5,6,6
1,002,GP,F,17,GT3,1,1,1,2,0,5,3,3,5,5,6
2,003,GP,F,15,LE3,1,1,1,2,3,4,3,2,7,8,10
3,004,GP,F,15,GT3,4,2,1,3,0,3,2,2,15,14,15
4,005,GP,F,16,GT3,3,3,1,2,0,4,3,2,6,10,10

In [14]:
# Find the missing values
studentmath.isnull().sum()

studentid          0
school             0
sex                0
age                0
famsize            0
mothereducation    0
fathereducation    0
traveltime         0
studytime          0
failures           0
famrel             0
freetime           0
goout              0
gradeperiod1       0
gradeperiod2       0
gradeperiod3       0
dtype: int64

In [15]:
# Set the index in studentid
studentmath.set_index('studentid', inplace=True)

In [16]:
studentmath.head()

,school,sex,age,famsize,mothereducation,fathereducation,traveltime,studytime,failures,famrel,freetime,goout,gradeperiod1,gradeperiod2,gradeperiod3
studentid,,,,,,,,,,,,,,,
001,GP,F,18,GT3,4,4,2,2,0,4,3,4,5,6,6
002,GP,F,17,GT3,1,1,1,2,0,5,3,3,5,5,6
003,GP,F,15,LE3,1,1,1,2,3,4,3,2,7,8,10
004,GP,F,15,GT3,4,2,1,3,0,3,2,2,15,14,15
005,GP,F,16,GT3,3,3,1,2,0,4,3,2,6,10,10

In [27]:
# To replace famrel, freetime, goout, mothereducation anf fathereducation with  meaningful values
setvalues = {'famrel':{1:"1:verybad",2:"2:bad",3:"3:neutral",4:"4:good",5:"5:excellent"},
                   "freetime":{1:"1:very low",2:"2:low",3:"3:neutral",4:"4:high",5:"5:very high"},
                   "goout":{1:"1:very low",2:"2:low",3:"3:neutral",4:"4:high",5:"5:very high"},
                    "mothereducation":{0:np.nan,1:"1:k-4",2:"2:5-9",3:"3:secondary ed",4:"4:higher ed"},
                    "fathereducation":{0:np.nan,1:"1:k-4",2:"2:5-9",3:"3:secondary ed",4:"4:higher ed"}
                   }

studentmath.replace(setvalues, inplace=True)

In [29]:
setvalueskeys = [key for key in setvalues]
print(setvalueskeys)

['famrel', 'freetime', 'goout', 'mothereducation', 'fathereducation']

In [30]:
studentmath.head()

,school,sex,age,famsize,mothereducation,fathereducation,traveltime,studytime,failures,famrel,freetime,goout,gradeperiod1,gradeperiod2,gradeperiod3
studentid,,,,,,,,,,,,,,,
001,GP,F,18,GT3,4:higher ed,4:higher ed,2,2,0,4:good,3:neutral,4:high,5,6,6
002,GP,F,17,GT3,1:k-4,1:k-4,1,2,0,5:excellent,3:neutral,3:neutral,5,5,6
003,GP,F,15,LE3,1:k-4,1:k-4,1,2,3,4:good,3:neutral,2:low,7,8,10
004,GP,F,15,GT3,4:higher ed,2:5-9,1,3,0,3:neutral,2:low,2:low,15,14,15
005,GP,F,16,GT3,3:secondary ed,3:secondary ed,1,2,0,4:good,3:neutral,2:low,6,10,10

In [36]:
# Check memory usage 
studentmath[setvalueskeys].memory_usage(index=False)

famrel             3160
freetime           3160
goout              3160
mothereducation    3160
fathereducation    3160
dtype: int64

In [37]:
studentmath.dtypes

school             object
sex                object
age                 int64
famsize            object
mothereducation    object
fathereducation    object
traveltime          int64
studytime           int64
failures            int64
famrel             object
freetime           object
goout              object
gradeperiod1        int64
gradeperiod2        int64
gradeperiod3        int64
dtype: object

In [41]:
# The setvalueskeys are objects and occupying large amount of space
# We can convert to categorical variables to reduce memory usage

for col in studentmath[setvalueskeys].columns:
    studentmath[col] = studentmath[col].astype('category')

In [42]:
# Check memory usage again
studentmath[setvalueskeys].memory_usage(index=False)

famrel             595
freetime           595
goout              595
mothereducation    587
fathereducation    587
dtype: int64

In [49]:
studentmath[['freetime','goout']].apply(pd.Series.value_counts, sort=False, normalize=True)

             freetime     goout
1:very low   0.048101  0.058228
2:low        0.162025  0.260759
3:neutral    0.397468  0.329114
4:high       0.291139  0.217722
5:very high  0.101266  0.134177

In [50]:
studentmath[['mothereducation','fathereducation']].apply(pd.Series.value_counts, sort=False, normalize=True)

                mothereducation  fathereducation
1:k-4                  0.150510         0.208651
2:5-9                  0.262755         0.292621
3:secondary ed         0.252551         0.254453
4:higher ed            0.334184         0.244275

# Import data from SPSS, Stata, and SAS

In [1]:
import pandas as pd
import numpy as np
import pyreadstat

In [4]:
data, metadata_spss = pyreadstat.read_sav('data/nls97.sav')

In [6]:
data

,R0000100,R0536300,R0536401,R0536402,R1235800,R1482600,R9793800,R9793900,R9871900,R9872000,...,U1852700,U2166200,U2166300,U2166400,U2166500,U2857300,U2962800,U2962900,U2963000,Z9063900
0,1.0,2.0,9.0,1981.0,1.0,4.0,350.0,470.0,309.0,310.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,52.0
1,2.0,1.0,7.0,1982.0,1.0,2.0,460.0,440.0,217.0,280.0,...,NaN,NaN,NaN,NaN,NaN,NaN,4.0,2.0,6.0,0.0
2,3.0,2.0,9.0,1983.0,1.0,2.0,NaN,NaN,NaN,NaN,...,0.0,NaN,NaN,NaN,NaN,NaN,6.0,2.0,6.0,0.0
3,4.0,2.0,2.0,1981.0,1.0,2.0,NaN,NaN,253.0,216.0,...,1.0,NaN,NaN,NaN,NaN,NaN,3.0,2.0,6.0,4.0
4,5.0,1.0,10.0,1982.0,1.0,2.0,NaN,NaN,243.0,235.0,...,0.0,NaN,NaN,NaN,NaN,NaN,2.0,2.0,5.0,12.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
8979,9018.0,2.0,3.0,1980.0,1.0,4.0,NaN,NaN,NaN,NaN,...,3.0,NaN,NaN,NaN,NaN,NaN,4.0,2.0,4.0,49.0
8980,9019.0,1.0,9.0,1984.0,0.0,2.0,NaN,NaN,NaN,NaN,...,4.0,NaN,NaN,NaN,NaN,NaN,2.0,2.0,6.0,0.0
8981,9020.0,1.0,7.0,1980.0,1.0,4.0,NaN,NaN,322.0,290.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,15.0
8982,9021.0,1.0,7.0,1980.0,1.0,4.0,NaN,NaN,230.0,184.0,...,0.0,NaN,NaN,NaN,NaN,NaN,6.0,2.0,7.0,50.0
8983,9022.0,2.0,1.0,1982.0,1.0,4.0,NaN,NaN,NaN,NaN,...,0.0,NaN,NaN,NaN,NaN,NaN,6.0,1.0,7.0,20.0

In [14]:
metadata_spss.variable_value_labels['R0536300']

{0.0: 'No Information', 1.0: 'Male', 2.0: 'Female'}

In [9]:
pyreadstat.read_sav??

In [ ]:
data.